docs/coq-ll.org
#+title: Linear Logic in Coq

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="custom.css">
#+OPTIONS: num:2 toc:2

------
[[file:index.org][Homepage]]

I present some notes and some todos about the paper.

* Paper
- [[https://gisellereis.com/papers/ll-coq.pdf]]
- Mechanizing Focused Linear Logic in Coq
- Xavier, Olarte, Reis, Nigam


* Summary
- Formalized propositional and first order linear logic and proved them to be equivalent.
- Proved cut-elimination and completeness of focusing
- Encoded LJ into LL
- Implementation: https://github.com/meta-logic/coq-ll
* Intro

** Basic notions
- Linear logic. A family of proof systems that lacks weakening and contraction; viewing formulas as resources  and has symmetry via distinguishing between multiplicative and additive connectives.
- Cut-elimination. Metatheorem stating that any proof using cut can be a proof without cut.
- Cut-elimination consequences. Implies consistency and subformula property.
- Focusing. Enforces that rules sharing properties (particularly invertibility) are grouped together
- Completeness of focusing. Metatheorem that if a proof of a formula exists a focused proof also exists
** Contributions
  The paper presents a formalization of linear logic in Coq. Their main contributions are:
*** Quantifiers
They use parametric HOAS to encode LL, which avoids the bureaucracy regarding substition and variable binding. However, this causes them to introduce some axioms.
*** Focusing completeness
They provide the first formalization of first-order LL's cut-elimination and LL's focused proof system completeness.
*** TODO Encoding proof systems
They encode LJ into LL.
*** Treatment of contexts
For LL, contexts are multisets due to the lack of contraction and weakening. They show admissibility of exchange. They use the Coq library =Morphisms= in order to substitute between equivalent multisets. They had to extend the =Morphisms= library. They also developed tactics that handle the proofs on multisets.
*** Induction measures
They follow Andreoli's proof of cut elimination closely.
* Syntax

**  Linear Logic connectives
There are =(+,-)= atoms, multiplicative connectives: tensor, 1, bot, par, additive connectives: oplus, and, 0, top, quantifiers: existential, universal, and exponential modalities: ! and ?.
