docs/coq-ll.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-13 Tue 15:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Logic in Coq</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linear Logic in Coq</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge3c5037">1. Paper</a></li>
<li><a href="#orgc6bf629">2. Summary</a></li>
<li><a href="#orgf036289">3. Intro</a>
<ul>
<li><a href="#org0bbc8f6">3.1. Basic notions</a></li>
<li><a href="#org73f2922">3.2. Contributions</a></li>
</ul>
</li>
<li><a href="#org1ad5fd1">4. Syntax</a>
<ul>
<li><a href="#orgcdc6baf">4.1. Linear Logic connectives</a></li>
<li><a href="#orgc160d7d">4.2. Some notes</a></li>
</ul>
</li>
<li><a href="#org6bbc940">5. <span class="todo TODO">TODO</span> Sequent Calculi</a>
<ul>
<li><a href="#orgb7aaf79">5.1. Focused system</a></li>
</ul>
</li>
<li><a href="#org6810df7">6. <span class="todo TODO">TODO</span> Metatheory</a>
<ul>
<li><a href="#org5da1420">6.1. <span class="todo TODO">TODO</span> Cut-Elimination proof</a></li>
</ul>
</li>
<li><a href="#org5109aa5">7. <span class="todo TODO">TODO</span> Applications</a></li>
<li><a href="#orgf1eb938">8. <span class="todo TODO">TODO</span> Related and Future Work</a></li>
<li><a href="#org8aa4146">9. <span class="todo TODO">TODO</span> The implementation</a></li>
<li><a href="#org93452cd">10. Key papers</a></li>
</ul>
</div>
</div>
<hr />
<p>
<a href="index.html">Homepage</a>
</p>

<p>
I present some notes and some todos about the paper.
</p>
<div id="outline-container-orge3c5037" class="outline-2">
<h2 id="orge3c5037"><span class="section-number-2">1.</span> Paper</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://gisellereis.com/papers/ll-coq.pdf">https://gisellereis.com/papers/ll-coq.pdf</a></li>
<li>Mechanizing Focused Linear Logic in Coq</li>
<li>Xavier, Olarte, Reis, Nigam</li>
</ul>
</div>
</div>
<div id="outline-container-orgc6bf629" class="outline-2">
<h2 id="orgc6bf629"><span class="section-number-2">2.</span> Summary</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Formalized propositional and first order linear logic and proved them to be equivalent.</li>
<li>Proved cut-elimination and completeness of focusing</li>
<li>Encoded LJ into LL</li>
<li>Implementation: <a href="https://github.com/meta-logic/coq-ll">https://github.com/meta-logic/coq-ll</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf036289" class="outline-2">
<h2 id="orgf036289"><span class="section-number-2">3.</span> Intro</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0bbc8f6" class="outline-3">
<h3 id="org0bbc8f6"><span class="section-number-3">3.1.</span> Basic notions</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Linear logic. A family of proof systems that lacks weakening and contraction; viewing formulas as resources  and has symmetry via distinguishing between multiplicative and additive connectives.</li>
<li>Cut-elimination. Metatheorem stating that any proof using cut can be a proof without cut.</li>
<li>Cut-elimination consequences. Implies consistency and subformula property.</li>
<li>Focusing. Enforces that rules sharing properties (particularly invertibility) are grouped together</li>
<li>Completeness of focusing. Metatheorem that if a proof of a formula exists a focused proof also exists</li>
</ul>
</div>
</div>
<div id="outline-container-org73f2922" class="outline-3">
<h3 id="org73f2922"><span class="section-number-3">3.2.</span> Contributions</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The paper presents a formalization of linear logic in Coq. Their main contributions are:
</p>
</div>
<div id="outline-container-org3ed194f" class="outline-4">
<h4 id="org3ed194f">Quantifiers</h4>
<div class="outline-text-4" id="text-org3ed194f">
<p>
They use parametric HOAS to encode LL, which avoids the bureaucracy regarding substition and variable binding. However, this causes them to introduce some axioms.
</p>
</div>
</div>
<div id="outline-container-orga86b7d7" class="outline-4">
<h4 id="orga86b7d7">Focusing completeness</h4>
<div class="outline-text-4" id="text-orga86b7d7">
<p>
They provide the first formalization of first-order LL&rsquo;s cut-elimination and LL&rsquo;s focused proof system completeness.
</p>
</div>
</div>
<div id="outline-container-orgec1ad80" class="outline-4">
<h4 id="orgec1ad80"><span class="todo TODO">TODO</span> Encoding proof systems</h4>
<div class="outline-text-4" id="text-orgec1ad80">
<p>
They encode LJ into LL.
</p>
</div>
</div>
<div id="outline-container-orgc303e38" class="outline-4">
<h4 id="orgc303e38">Treatment of contexts</h4>
<div class="outline-text-4" id="text-orgc303e38">
<p>
For LL, contexts are multisets due to the lack of contraction and weakening. They show admissibility of exchange. They use the Coq library <code>Morphisms</code> in order to substitute between equivalent multisets. They had to extend the <code>Morphisms</code> library. They also developed tactics that handle the proofs on multisets.
</p>
</div>
</div>
<div id="outline-container-org240b241" class="outline-4">
<h4 id="org240b241">Induction measures</h4>
<div class="outline-text-4" id="text-org240b241">
<p>
They follow Andreoli&rsquo;s proof of cut elimination closely.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org1ad5fd1" class="outline-2">
<h2 id="org1ad5fd1"><span class="section-number-2">4.</span> Syntax</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcdc6baf" class="outline-3">
<h3 id="orgcdc6baf"><span class="section-number-3">4.1.</span> Linear Logic connectives</h3>
<div class="outline-text-3" id="text-4-1">
<p>
There are <code>(+,-)</code> atoms, multiplicative connectives: tensor, 1, bot, par, additive connectives: oplus, and, 0, top, quantifiers: existential, universal, and exponential modalities: ! and ?.
</p>
</div>
</div>
