docs/coq-ll.org
** Some notes

I have notes but I don't really understand them, especially the nuances about higher-order abstract syntax.

- Using =(var -> formula) -> formula= for quantifiers means dealing with bureaucracy about variable capture and substitution.
- So, they do =Qx.F= (=Q= being a quantifier) as =Q(\lambda x. F)=, of type =(term -> formula) -> formula=. This is called higher-order abstract syntax.
- However, =term -> formula= is problematic as one can return arbitrary formulas (? - Chlipala)
- Instead, they use parametrized higher-order abstract syntax. The parameter is =T= for quantifier variables. The new type for quantifiers is now =foraall T, (T -> formula) -> formula=.
- Apparently, per Chlipala, this makes it impossible to compute size of formula.
- They parametrize T outside of the constructors; they parametrize in the meta level outside the syntax specification. See page 4.
- Here is the syntax implemented:

#+BEGIN_SRC coq
Section Sec_lExp.
Variable T: Type. (* Parameter for building variables *)
Inductive term := (* Terms *)
| var (t: T) | cte (e: A) (* variables and constants *)
| fc1 (n: nat) (t: term) | fc2 (n: nat) (t1 t2: term). (* family of functions *)
Inductive aprop := (* Atomic propositions *)
| a0: nat → aprop (* 0-ary predicates *)
| a1: nat → term → aprop | a2: nat → term → term → aprop. (* family of predicates *)
Inductive lexp := (* Formulas *)
| atom (a :aprop) ) | perp (a: aprop) (* positive/negated atoms *)
| top | bot | zero | one (* units *)
| tensor (F G: lexp) | par (F G: lexp) (* multiplicative *)
| plus (F G: lexp) | witH (F G: lexp) (* additive *)
| bang (F: lexp) | quest (F: lexp) (* exponentials *)
| ex (f: T → lexp) | fx (f: T → lexp). (* quantifiers *)
End Sec_lExp.
#+END_SRC

- Type of top is not =lexp= but =forall t: T, lexp t=, e.g. =top nat : lexp nat=. But we do not want that; hence we define connectives as functions taking =T=, e.g. =Top : Lexp= is =fun T => top=. =T= is not destructed; instead it is irrelevant, so it doesn't interfere with structure.

  #+BEGIN_SRC coq
Definition Term := forall T: Type, term T. (* type for terms *)
Definition AProp := forall T: Type, aprop T. (* type for atomic propositions *)
Definition Lexp := forall T: Type, lexp T. (* Type for formulas *)

Definition Top: Lexp := fun T ⇒ top. (* formula >*)
Definition Atom (P: AProp): Lexp := fun T ⇒ atom (P T). (* building atomic propositions *)
Definition Tensor (F G: Lexp): Lexp := fun T ⇒ tensor (F T) (G T). (* formula F ⊗ G *)
...
#+END_SRC
- =Lexp= is a polymorphic function, not inductive type. Hence, induction on =F:Lexp= can't use Coq's tactics: =destruct=, =induction=, =inversion=.
- Hence, we define a "closed formulas" inductive type. We will have to provide an axiom that closed structures can be built. This axiom is consistent with Coq but cannot be proven in Coq.

#+BEGIN_SRC coq
Inductive ClosedT: Term → Prop :=
| cl_cte: forall C, ClosedT (Cte C)
| cl_fc1: forall n t1, ClosedT t1 → ClosedT (FC1 n t1)
| cl_fc2: forall n t1 t2, ClosedT t1 → ClosedT t2 → ClosedT (FC2 n t1 t2).
Inductive ClosedA : AProp → Prop :=
| cl_a0: forall n, ClosedA (A0 n)
| cl_a1: forall n t, ClosedT t → ClosedA (fun _ ⇒ a1 n (t _)).
| cl_a2: forall n t t’, ClosedT t → ClosedT t’ → ClosedA (fun _ ⇒ a2 n (t _) (t’ _)).
Inductive Closed : Lexp → Prop :=
| cl_atom: forall A, ClosedA A → Closed (Atom A )
| cl_perp: forall A, ClosedA A → Closed (Perp A )
| cl_one: Closed One
| cl_tensor: forall F G, Closed F → Closed G → Closed (Tensor F G)
| cl_fx: forall FX, Closed (Fx FX)
[...]
  #+END_SRC

  The axioms:

  #+BEGIN_SRC coq
Axiom ax_closedT: forall X: Term, ClosedT X.
Axiom ax_closedA: forall A: AProp, ClosedA A.
Axiom ax_closed : forall F: Lexp, Closed F
 #+END_SRC
- Why are closed terms needed? Consider an example: If =1= is the identifier of proposition =P=, =c= is a constant of type =A=, then we represent =P(c)= as:
  #+BEGIN_SRC coq
Pc : Lexp => fun T : Type => atom (a1 1 (cte c))
  #+END_SRC

- This is fine. But now consider =P(x)= where =x= is a free variable. Our representation of =P(x)= is:
    #+BEGIN_SRC coq
Px : Lexp => fun T : Type => atom (a1 1 (var ??))
  #+END_SRC
  We have =??= in there. Looking at the definition of =var=, we would need to provide a =t : T=. But we don't know anything about this generic =T=, yet we are asked to provide an inhabitant of =T= (what if it is uninhabited?). Hence we must use closed terms and formulas without these free variables.
- They define a type =Subs= for substitutions and a substition function =Subst= taking a =S : Subs= and a =X : Term=. =X= is substituted in =S=.
  #+BEGIN_SRC coq
  Definition Subs := forall T: Type, T → lexp T.
  Definition Subst (S: Subs) (X: Term) : Lexp := fun T: Type ⇒ flatten (S (term T) (X T)).

  (** Example *)

  Definition S: Subs := fun (T: Type) (x: T) ⇒ tensor top (atom (a2 1 (fc1 1 (var x)) (cte c))).
Definition t1: Term := fun T ⇒ (cte d).
Eval compute in Subst S t1.
(* Result: fun T:Type ⇒ tensor one (atom (a2 4 (fc1 1 (cte d)) (cte c)))
#+END_SRC
- They prove two formulas are equivalent modulo remaining of bound variables. (?). ...



