docs/coq-ll.html
<div id="outline-container-orgc160d7d" class="outline-3">
<h3 id="orgc160d7d"><span class="section-number-3">4.2.</span> Some notes</h3>
<div class="outline-text-3" id="text-4-2">
<p>
I have notes but I don&rsquo;t really understand them, especially the nuances about higher-order abstract syntax.
</p>

<ul class="org-ul">
<li>Using <code>(var -&gt; formula) -&gt; formula</code> for quantifiers means dealing with bureaucracy about variable capture and substitution.</li>
<li>So, they do <code>Qx.F</code> (<code>Q</code> being a quantifier) as <code>Q(\lambda x. F)</code>, of type <code>(term -&gt; formula) -&gt; formula</code>. This is called higher-order abstract syntax.</li>
<li>However, <code>term -&gt; formula</code> is problematic as one can return arbitrary formulas (? - Chlipala)</li>
<li>Instead, they use parametrized higher-order abstract syntax. The parameter is <code>T</code> for quantifier variables. The new type for quantifiers is now <code>foraall T, (T -&gt; formula) -&gt; formula</code>.</li>
<li>Apparently, per Chlipala, this makes it impossible to compute size of formula.</li>
<li>They parametrize T outside of the constructors; they parametrize in the meta level outside the syntax specification. See page 4.</li>
<li>Here is the syntax implemented:</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Section</span> <span style="color: #A9DC76;">Sec_lExp</span>.
<span style="color: #FF6188;">Variable</span> <span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span>. <span style="color: #727072;">(* </span><span style="color: #727072;">Parameter for building variables</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">term</span> := <span style="color: #727072;">(* </span><span style="color: #727072;">Terms</span><span style="color: #727072;"> *)</span>
| var (<span style="color: #FCFCFA;">t</span>: T) | cte (<span style="color: #FCFCFA;">e</span>: A) <span style="color: #727072;">(* </span><span style="color: #727072;">variables and constants</span><span style="color: #727072;"> *)</span>
| fc1 (<span style="color: #FCFCFA;">n</span>: nat) (<span style="color: #FCFCFA;">t</span>: term) | fc2 (<span style="color: #FCFCFA;">n</span>: nat) (<span style="color: #FCFCFA;">t1 t2</span>: term). <span style="color: #727072;">(* </span><span style="color: #727072;">family of functions</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">aprop</span> := <span style="color: #727072;">(* </span><span style="color: #727072;">Atomic propositions</span><span style="color: #727072;"> *)</span>
| a0: nat &#8594; aprop <span style="color: #727072;">(* </span><span style="color: #727072;">0-ary predicates</span><span style="color: #727072;"> *)</span>
| a1: nat &#8594; term &#8594; aprop | a2: nat &#8594; term &#8594; term &#8594; aprop. <span style="color: #727072;">(* </span><span style="color: #727072;">family of predicates</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">lexp</span> := <span style="color: #727072;">(* </span><span style="color: #727072;">Formulas</span><span style="color: #727072;"> *)</span>
| atom (<span style="color: #FCFCFA;">a</span> :aprop) ) | perp (<span style="color: #FCFCFA;">a</span>: aprop) <span style="color: #727072;">(* </span><span style="color: #727072;">positive/negated atoms</span><span style="color: #727072;"> *)</span>
| top | bot | zero | one <span style="color: #727072;">(* </span><span style="color: #727072;">units</span><span style="color: #727072;"> *)</span>
| tensor (<span style="color: #FCFCFA;">F G</span>: lexp) | par (<span style="color: #FCFCFA;">F G</span>: lexp) <span style="color: #727072;">(* </span><span style="color: #727072;">multiplicative</span><span style="color: #727072;"> *)</span>
| plus (<span style="color: #FCFCFA;">F G</span>: lexp) | witH (<span style="color: #FCFCFA;">F G</span>: lexp) <span style="color: #727072;">(* </span><span style="color: #727072;">additive</span><span style="color: #727072;"> *)</span>
| bang (<span style="color: #FCFCFA;">F</span>: lexp) | quest (<span style="color: #FCFCFA;">F</span>: lexp) <span style="color: #727072;">(* </span><span style="color: #727072;">exponentials</span><span style="color: #727072;"> *)</span>
| ex (<span style="color: #FCFCFA;">f</span>: T &#8594; lexp) | fx (<span style="color: #FCFCFA;">f</span>: T &#8594; lexp). <span style="color: #727072;">(* </span><span style="color: #727072;">quantifiers</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">End</span> <span style="color: #A9DC76;">Sec_lExp</span>.
</pre>
</div>

<ul class="org-ul">
<li><p>
Type of top is not <code>lexp</code> but <code>forall t: T, lexp t</code>, e.g. <code>top nat : lexp nat</code>. But we do not want that; hence we define connectives as functions taking <code>T</code>, e.g. <code>Top : Lexp</code> is <code>fun T =&gt; top</code>. <code>T</code> is not destructed; instead it is irrelevant, so it doesn&rsquo;t interfere with structure.
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Term</span> := <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span>, term T. <span style="color: #727072;">(* </span><span style="color: #727072;">type for terms</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">AProp</span> := <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span>, aprop T. <span style="color: #727072;">(* </span><span style="color: #727072;">type for atomic propositions</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Lexp</span> := <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span>, lexp T. <span style="color: #727072;">(* </span><span style="color: #727072;">Type for formulas</span><span style="color: #727072;"> *)</span>

<span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Top</span>: Lexp := <span style="color: #78DCE8;">fun</span> T &#8658; top. <span style="color: #727072;">(* </span><span style="color: #727072;">formula &gt;</span><span style="color: #727072;">*)</span>
<span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Atom</span> (<span style="color: #FCFCFA;">P</span>: AProp): Lexp := <span style="color: #78DCE8;">fun</span> T &#8658; atom (P T). <span style="color: #727072;">(* </span><span style="color: #727072;">building atomic propositions</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Tensor</span> (<span style="color: #FCFCFA;">F G</span>: Lexp): Lexp := <span style="color: #78DCE8;">fun</span> T &#8658; tensor (F T) (G T). <span style="color: #727072;">(* </span><span style="color: #727072;">formula F &#8855; G</span><span style="color: #727072;"> *)</span>
...
</pre>
</div></li>
<li><code>Lexp</code> is a polymorphic function, not inductive type. Hence, induction on <code>F:Lexp</code> can&rsquo;t use Coq&rsquo;s tactics: <code>destruct</code>, <code>induction</code>, <code>inversion</code>.</li>
<li>Hence, we define a &ldquo;closed formulas&rdquo; inductive type. We will have to provide an axiom that closed structures can be built. This axiom is consistent with Coq but cannot be proven in Coq.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">ClosedT</span>: Term &#8594; <span style="color: #78DCE8;">Prop</span> :=
| cl_cte: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">C</span>, ClosedT (Cte C)
| cl_fc1: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">n t1</span>, ClosedT t1 &#8594; ClosedT (FC1 n t1)
| cl_fc2: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">n t1 t2</span>, ClosedT t1 &#8594; ClosedT t2 &#8594; ClosedT (FC2 n t1 t2).
<span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">ClosedA</span> : AProp &#8594; <span style="color: #78DCE8;">Prop</span> :=
| cl_a0: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">n</span>, ClosedA (A0 n)
| cl_a1: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">n t</span>, ClosedT t &#8594; ClosedA (<span style="color: #78DCE8;">fun</span> _ &#8658; a1 n (t _)).
| cl_a2: <span style="color: #78DCE8;">forall</span> n t t&#8217;, ClosedT t &#8594; ClosedT t&#8217; &#8594; ClosedA (<span style="color: #78DCE8;">fun</span> _ &#8658; a2 n (t _) (t&#8217; _)).
<span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">Closed</span> : Lexp &#8594; <span style="color: #78DCE8;">Prop</span> :=
| cl_atom: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">A</span>, ClosedA A &#8594; Closed (Atom A )
| cl_perp: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">A</span>, ClosedA A &#8594; Closed (Perp A )
| cl_one: Closed One
| cl_tensor: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">F G</span>, Closed F &#8594; Closed G &#8594; Closed (Tensor F G)
| cl_fx: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">FX</span>, Closed (Fx FX)
[...]
</pre>
</div>

<p>
The axioms:
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Axiom</span> <span style="color: #FCFCFA;">ax_closedT</span>: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">X</span>: Term, ClosedT X.
<span style="color: #FF6188;">Axiom</span> <span style="color: #FCFCFA;">ax_closedA</span>: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">A</span>: AProp, ClosedA A.
<span style="color: #FF6188;">Axiom</span> <span style="color: #FCFCFA;">ax_closed</span> : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">F</span>: Lexp, Closed F
</pre>
</div>
<ul class="org-ul">
<li><p>
Why are closed terms needed? Consider an example: If <code>1</code> is the identifier of proposition <code>P</code>, <code>c</code> is a constant of type <code>A</code>, then we represent <code>P(c)</code> as:
</p>
<div class="org-src-container">
<pre class="src src-coq">Pc : Lexp =&gt; <span style="color: #78DCE8;">fun</span> <span style="color: #FCFCFA;">T</span> : <span style="color: #78DCE8;">Type</span> =&gt; atom (a1 <span style="color: #AB9DF2; font-weight: bold;">1</span> (cte c))
</pre>
</div></li>

<li><p>
This is fine. But now consider <code>P(x)</code> where <code>x</code> is a free variable. Our representation of <code>P(x)</code> is:
</p>
<div class="org-src-container">
<pre class="src src-coq">Px : Lexp =&gt; <span style="color: #78DCE8;">fun</span> <span style="color: #FCFCFA;">T</span> : <span style="color: #78DCE8;">Type</span> =&gt; atom (a1 <span style="color: #AB9DF2; font-weight: bold;">1</span> (var ??))
</pre>
</div>
<p>
We have <code>??</code> in there. Looking at the definition of <code>var</code>, we would need to provide a <code>t : T</code>. But we don&rsquo;t know anything about this generic <code>T</code>, yet we are asked to provide an inhabitant of <code>T</code> (what if it is uninhabited?). Hence we must use closed terms and formulas without these free variables.
</p></li>
<li><p>
They define a type <code>Subs</code> for substitutions and a substition function <code>Subst</code> taking a <code>S : Subs</code> and a <code>X : Term</code>. <code>X</code> is substituted in <code>S</code>.
</p>
<div class="org-src-container">
<pre class="src src-coq">  <span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Subs</span> := <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span>, T &#8594; lexp T.
  <span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">Subst</span> (<span style="color: #FCFCFA;">S</span>: Subs) (<span style="color: #FCFCFA;">X</span>: Term) : Lexp := <span style="color: #78DCE8;">fun</span> <span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span> &#8658; flatten (S (term T) (X T)).

  <span style="color: #FFD866;">(** Example *)</span>

  <span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">S</span>: Subs := <span style="color: #78DCE8;">fun</span> (<span style="color: #FCFCFA;">T</span>: <span style="color: #78DCE8;">Type</span>) (<span style="color: #FCFCFA;">x</span>: T) &#8658; tensor top (atom (a2 <span style="color: #AB9DF2; font-weight: bold;">1</span> (fc1 <span style="color: #AB9DF2; font-weight: bold;">1</span> (var x)) (cte c))).
<span style="color: #FF6188;">Definition</span> <span style="color: #A9DC76;">t1</span>: Term := <span style="color: #78DCE8;">fun</span> T &#8658; (cte d).
<span style="color: #FF6188;">Eval</span> <span style="text-decoration: underline;">compute</span> <span style="color: #78DCE8;">in</span> Subst S t1.
<span style="color: #727072;">(* </span><span style="color: #727072;">Result: fun T:Type &#8658; tensor one (atom (a2 4 (fc1 1 (cte d)) (cte c)))</span>
</pre>
</div></li>
<li>They prove two formulas are equivalent modulo remaining of bound variables. (?). &#x2026;</li>
</ul>
</div>
</div>
</div>
