docs/coq-ll.org
* TODO Sequent Calculi

- They depict classical first order linear logic. Fig 1, page 7.
  - Then they study a different version with dyadic sequents, via Andreoli. An excerpt:
#+BEGIN_SRC coq
Inductive sig2: list Lexp → list Lexp → Prop :=
| sig2_init : forall B L A, L =mul= (A +) :: [A −] → ` B ; L
| sig2_bang: forall B F L , L =mul= [! F] → ` B ; [F] → ` B ; L
| sig2_ex : forall B L FX M t, L =mul= E{FX} :: M → ` B ; ( Subst FX t) :: M → ` B ; L
| sig2_fx : forall B L FX M, L =mul= (F{FX}) :: M → (forall x, ` B ; [Subst FX x] ++ M) → ` B ; L
#+END_SRC

** Focused system
*** Focusing in LL
Focusing is a discipline by Andreoli aiming to reduce non-determinism. Proof as organized in two alternating phases, called negative phase (which contains only invertible rules) and positive phase (containing only non-invertible rules). The invertible connectives: are par, bot, and, top, ?, universal quantifier. The non-invertible connectives are: tensor, 1, oplus, !, existential quantifier.
*** LLF (Triadic focusing system for LL)
- =\vbar \Theta : \Gamma \uparrow L= belongs to the negative phase. All positive formulas and atoms are moved to =\Gamma=.
- =\vbar \Theta : \Gamma \downarrow A= belongs to the positive phase.
*** TODO Try out focusing
It might be pedagogical to do a handwritten proof of a focused sequent: (see page 9 for proper rendering)
#+BEGIN_SRC coq
Example sequent: ` [] ; [] ; UP( [ ( p−Nq−) O ⊥ O ?p+ O ?q+ ] ).
Proof with unfold p;unfold q;InvTac.
NegPhase. (* Negative phase *)
eapply tri_dec2 with (F:= p+) ... (* apply the decision rule on the classical context *)
eapply tri_dec2 with (F:= q+) ...
Qed.
#+END_SRC

Note that the formalized proof use user-defined tactics (from the authors) like InvTac, NegPhase, etc.

* TODO Metatheory
This section formalizes cut-elimination for the dyadic LL and completeness of focusing. They show the equivalence of all the systems and prove the consistency of LL as a corollary. (?).

** TODO Cut-Elimination proof
(...)
**

* TODO Applications
They encode LJ into LL.

* TODO Related and Future Work
(...)

* TODO The implementation
I plan to check out the implementation and run the proofs. However, I am facing some difficulties compiling it right now.

* Key papers
- Andreoli's proofs on focused linear logic
- Chlipala on parametric higher order syntax
