docs/coq-ll.html
<div id="outline-container-org6bbc940" class="outline-2">
<h2 id="org6bbc940"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Sequent Calculi</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>They depict classical first order linear logic. Fig 1, page 7.
<ul class="org-ul">
<li>Then they study a different version with dyadic sequents, via Andreoli. An excerpt:</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">sig2</span>: list Lexp &#8594; list Lexp &#8594; <span style="color: #78DCE8;">Prop</span> :=
| sig2_init : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">B L A</span>, L =mul= (A +) :: [A &#8722;] &#8594; ` B ; L
| sig2_bang: <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">B F L</span> , L =mul= [! F] &#8594; ` B ; [F] &#8594; ` B ; L
| sig2_ex : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">B L FX M t</span>, L =mul= E{FX} :: M &#8594; ` B ; ( Subst FX t) :: M &#8594; ` B ; L
| sig2_fx : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">B L FX M</span>, L =mul= (F{FX}) :: M &#8594; (<span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">x</span>, ` B ; [Subst FX x] ++ M) &#8594; ` B ; L
</pre>
</div>
</div>
<div id="outline-container-orgb7aaf79" class="outline-3">
<h3 id="orgb7aaf79"><span class="section-number-3">5.1.</span> Focused system</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org88125bb" class="outline-4">
<h4 id="org88125bb">Focusing in LL</h4>
<div class="outline-text-4" id="text-org88125bb">
<p>
Focusing is a discipline by Andreoli aiming to reduce non-determinism. Proof as organized in two alternating phases, called negative phase (which contains only invertible rules) and positive phase (containing only non-invertible rules). The invertible connectives: are par, bot, and, top, ?, universal quantifier. The non-invertible connectives are: tensor, 1, oplus, !, existential quantifier.
</p>
</div>
</div>
<div id="outline-container-orgb0d1e25" class="outline-4">
<h4 id="orgb0d1e25">LLF (Triadic focusing system for LL)</h4>
<div class="outline-text-4" id="text-orgb0d1e25">
<ul class="org-ul">
<li><code>\vbar \Theta : \Gamma \uparrow L</code> belongs to the negative phase. All positive formulas and atoms are moved to <code>\Gamma</code>.</li>
<li><code>\vbar \Theta : \Gamma \downarrow A</code> belongs to the positive phase.</li>
</ul>
</div>
</div>
<div id="outline-container-org6c6bb41" class="outline-4">
<h4 id="org6c6bb41"><span class="todo TODO">TODO</span> Try out focusing</h4>
<div class="outline-text-4" id="text-org6c6bb41">
<p>
It might be pedagogical to do a handwritten proof of a focused sequent: (see page 9 for proper rendering)
</p>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Example</span> <span style="color: #A9DC76;">sequent</span>: ` [] ; [] ; UP( [ ( p&#8722;Nq&#8722;) O &#8869; O <span style="color: #FCFCFA;">?p</span>+ O <span style="color: #FCFCFA;">?q</span>+ ] ).
<span style="color: #FF6188;">Proof</span> <span style="color: #78DCE8;">with</span> <span style="text-decoration: underline;">unfold</span> p;<span style="text-decoration: underline;">unfold</span> q;InvTac.
NegPhase. <span style="color: #727072;">(* </span><span style="color: #727072;">Negative phase</span><span style="color: #727072;"> *)</span>
<span style="text-decoration: underline;">eapply</span> tri_dec2 <span style="color: #78DCE8;">with</span> (F:= p+) ... <span style="color: #727072;">(* </span><span style="color: #727072;">apply the decision rule on the classical context</span><span style="color: #727072;"> *)</span>
<span style="text-decoration: underline;">eapply</span> tri_dec2 <span style="color: #78DCE8;">with</span> (F:= q+) ...
<span style="color: #FF6188;">Qed</span>.
</pre>
</div>

<p>
Note that the formalized proof use user-defined tactics (from the authors) like InvTac, NegPhase, etc.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6810df7" class="outline-2">
<h2 id="org6810df7"><span class="section-number-2">6.</span> <span class="todo TODO">TODO</span> Metatheory</h2>
<div class="outline-text-2" id="text-6">
<p>
This section formalizes cut-elimination for the dyadic LL and completeness of focusing. They show the equivalence of all the systems and prove the consistency of LL as a corollary. (?).
</p>
</div>
<div id="outline-container-org5da1420" class="outline-3">
<h3 id="org5da1420"><span class="section-number-3">6.1.</span> <span class="todo TODO">TODO</span> Cut-Elimination proof</h3>
<div class="outline-text-3" id="text-6-1">
<p>
(&#x2026;)
**
</p>
</div>
</div>
</div>
<div id="outline-container-org5109aa5" class="outline-2">
<h2 id="org5109aa5"><span class="section-number-2">7.</span> <span class="todo TODO">TODO</span> Applications</h2>
<div class="outline-text-2" id="text-7">
<p>
They encode LJ into LL.
</p>
</div>
</div>
<div id="outline-container-orgf1eb938" class="outline-2">
<h2 id="orgf1eb938"><span class="section-number-2">8.</span> <span class="todo TODO">TODO</span> Related and Future Work</h2>
<div class="outline-text-2" id="text-8">
<p>
(&#x2026;)
</p>
</div>
</div>
<div id="outline-container-org8aa4146" class="outline-2">
<h2 id="org8aa4146"><span class="section-number-2">9.</span> <span class="todo TODO">TODO</span> The implementation</h2>
<div class="outline-text-2" id="text-9">
<p>
I plan to check out the implementation and run the proofs. However, I am facing some difficulties compiling it right now.
</p>
</div>
</div>
<div id="outline-container-org93452cd" class="outline-2">
<h2 id="org93452cd"><span class="section-number-2">10.</span> Key papers</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Andreoli&rsquo;s proofs on focused linear logic</li>
<li>Chlipala on parametric higher order syntax</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-05-13 Tue 15:06</p>
</div>
</body>
</html>
